Repository: python/pootle-python-org-backup
Catalog: tmxes/ru/reference.tmx
Source language: en
Languages: ru

source: In a generator function, the :keyword:`return` statement is not allowed to include an :token:`expression_list`. In that context, a bare :keyword:`return` indicates that the generator is done and will cause :exc:`StopIteration` to be raised.
ru: В функции-генераторе инструкция «:keyword:`return`» не может иметь синтаксический элемент «:token:`expression_list`» , тоесть вообще каких-либо аргументов. В этом контексте «:keyword:`return`» без аргументов – является сигналом того, что генератор завершил работу, и приведёт к вызову «:exc:`StopIteration`» .

source: The :keyword:`yield` statement
ru: Инструкция «:keyword:`yield`»

source: The :keyword:`yield` statement is only used when defining a generator function, and is only used in the body of the generator function. Using a :keyword:`yield` statement in a function definition is sufficient to cause that definition to create a generator function instead of a normal function. When a generator function is called, it returns an iterator known as a generator iterator, or more commonly, a generator. The body of the generator function is executed by calling the :func:`next` function on the generator repeatedly until it raises an exception.
ru: Инструкция «:keyword:`yield`» используется только при определении функций-генераторов и встречается только внутри такой функции. Использование инструкции «:keyword:`yield`» в какой-либо функции – является однозначным сигналом, который приводит к тому, что данное определение вместо обычной функции создаёт функцию-генератор. При вызове функции-генератора – она возвращает итератор, также называемый : “итератор-генератор” , или просто : “генератор” . Тело функции-генератора исполняется посредством вызова функции «:func:`next`» , применённой к данному генератору, повторяясь до получения исключения.

source: When a :keyword:`yield` statement is executed, the state of the generator is frozen and the value of :token:`expression_list` is returned to :meth:`next`'s caller. By "frozen" we mean that all local state is retained, including the current bindings of local variables, the instruction pointer, and the internal evaluation stack: enough information is saved so that the next time :func:`next` is invoked, the function can proceed exactly as if the :keyword:`yield` statement were just another external call.
ru: Когда исполняется инструкция «:keyword:`yield`» – состояние содержащей её функции-генератора замораживается, а значение аргументов «:keyword:`yield`» («:token:`expression_list`») возвращается в место вызова функции «:meth:`next`» . Под “замораживается” подразумевается то, что всё локальное состояние сохраняется, включая текущие связывания (значения) локальных переменных, указатель на инструкцию (с которой продолжать) и внутренний стек вычислений. Тоесть сохраняется исчерпывающая информация для того, чтобы, когда в следующий раз будет вызвана инструкция «:meth:`next`» , функция-генератор могла продолжаться точно также, как если бы вместо инструкции «:keyword:`yield`» был какой-либо вызов внешней функции.

source: The proposal that, among other generator enhancements, proposed allowing :keyword:`yield` to appear inside a :keyword:`try` ... :keyword:`finally` block.
ru: Предложение, которое помимо других улучшений генератора, предполагает разрешение инструкции «:keyword:`yield`» внутри блока «:keyword:`try` ... :keyword:`finally`» .

source: The :keyword:`raise` statement
ru: Инструкция «:keyword:`raise`»

source: If no expressions are present, :keyword:`raise` re-raises the last exception that was active in the current scope. If no exception is active in the current scope, a :exc:`TypeError` exception is raised indicating that this is an error (if running under IDLE, a :exc:`queue.Empty` exception is raised instead).
ru: Если не заданы выражения, то «:keyword:`raise`» перевызывает последнее исключение, которое было активно в текущей области. А если в текущей области нет активных исключений, то вызывается исключение «:exc:`TypeError`» , сигнализирующее о неопределённой ошибке (при работе под “IDLE” вызывается исключение «:exc:`queue.Empty`» ) .

source: Otherwise, :keyword:`raise` evaluates the first expression as the exception object. It must be either a subclass or an instance of :class:`BaseException`. If it is a class, the exception instance will be obtained when needed by instantiating the class with no arguments.
ru: Если выражения заданы, то «:keyword:`raise`» расценивает первое как объект-исключение – оно должно быть или экземпляром или подклассом «:class:`BaseException`» . В последнем случае, если потребуется, соответствующий экземпляр исключения будет сгенерирован из этого класса без аргументов.

source: The :dfn:`type` of the exception is the exception instance's class, the :dfn:`value` is the instance itself.
ru: Типом данного исключения является класс экземпляра данного исключения, а значением является сам этот экземпляр.

source: A traceback object is normally created automatically when an exception is raised and attached to it as the :attr:`__traceback__` attribute, which is writable. You can create an exception and set your own traceback in one step using the :meth:`with_traceback` exception method (which returns the same exception instance, with its traceback set to its argument), like so::
ru: Объект трассировки в норме создаётся автоматически, когда инициируется исключение, и присоединяется к этому исключению в качестве изменяемого атрибута «:attr:`__traceback__`» . Вы можете создать исключение и установить собственный объект трассировки за один шаг, используя метод исключения – «:meth:`with_traceback`» (который возвращает тот же экземпляр исключения, но с его объектом трассировки установленным в значение аргумента) . Например : ::

source: The ``from`` clause is used for exception chaining: if given, the second *expression* must be another exception class or instance, which will then be attached to the raised exception as the :attr:`__cause__` attribute (which is writable). If the raised exception is not handled, both exceptions will be printed::
ru: Часть после ключевого слова «``from``» используется для связывания исключений : если это второе выражение задано, оно должно быть ещё одним классом или экземпляром исключения – этот объект будет присоединён к вызываемому (основному) исключению как изменяемый атрибут «:attr:`__cause__`» . Если вызванное исключение не обработано, то будут напечатаны оба исключения : ::

source: A similar mechanism works implicitly if an exception is raised inside an exception handler: the previous exception is then attached as the new exception's :attr:`__context__` attribute::
ru: Подобный же механизм работает неявно, если исключение инициировано внутри обработчика исключения : предыдущее исключение присоединяется как новый атрибут «:attr:`__context__`» исключения :

source: Additional information on exceptions can be found in section :ref:`exceptions`, and information about handling exceptions is in section :ref:`try`.
ru: Дополнительную информацию об исключениях смотрите в разделе “:ref:`exceptions`” , а об обработке исключений – в разделе “:ref:`try`” .

source: The :keyword:`break` statement
ru: Инструкция «:keyword:`break`»

source: :keyword:`break` may only occur syntactically nested in a :keyword:`for` or :keyword:`while` loop, but not nested in a function or class definition within that loop.
ru: «:keyword:`break`» может встречаться только находясь синтаксически непосредственно внутри цикла «:keyword:`for`» или «:keyword:`while`» , но не внутри определения функции или класса, находящегося внутри этого цикла.

source: It terminates the nearest enclosing loop, skipping the optional :keyword:`else` clause if the loop has one.
ru: Эта инструкция прекращает ближайший объемлющий цикл, пропуская его ветвь «:keyword:`else`» , если она есть.

source: If a :keyword:`for` loop is terminated by :keyword:`break`, the loop control target keeps its current value.
ru: Если цикл «:keyword:`for`» прекращён инструкцией «:keyword:`break`», то переменная-цель со значением текущего элемента перебираемого множества – сохраняет своё значение.

source: When :keyword:`break` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`finally` clause is executed before really leaving the loop.
ru: Когда «:keyword:`break`» прекращает цикл, находясь внутри инструкции «:keyword:`try`» , имеющей ветвь «:keyword:`finally`» , то эта ветвь выполняется раньше выхода из цикла.

source: The :keyword:`continue` statement
ru: Инструкция «:keyword:`continue`»

source: :keyword:`continue` may only occur syntactically nested in a :keyword:`for` or :keyword:`while` loop, but not nested in a function or class definition or :keyword:`finally` clause within that loop. It continues with the next cycle of the nearest enclosing loop.
ru: «:keyword:`continue`» может встречаться только находясь синтаксически внутри цикла «:keyword:`for`» или «:keyword:`while`» , но не внутри определения функции или класса или внутри ветви «:keyword:`finally`», находящихся внутри этого цикла. Эта инструкция продолжает выполнение ближайшего объемлющего цикла с нового прохода.

source: When :keyword:`continue` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`finally` clause is executed before really starting the next loop cycle.
ru: Когда «:keyword:`continue`» исполняется внутри инструкции «:keyword:`try`» , имеющей ветвь «:keyword:`finally`» , то эта ветвь выполняется раньше нового прохода цикла.

source: The :keyword:`import` statement
ru: Инструкция «:keyword:`import`»

source: Import statements are executed in two steps: (1) find a module, and initialize it if necessary; (2) define a name or names in the local namespace (of the scope where the :keyword:`import` statement occurs). The statement comes in two forms differing on whether it uses the :keyword:`from` keyword. The first form (without :keyword:`from`) repeats these steps for each identifier in the list. The form with :keyword:`from` performs step (1) once, and then performs step (2) repeatedly. For a reference implementation of step (1), see the :mod:`importlib` module.
ru: Инструкции «import» исполняются в два шага:1: находится модуль, и, если необходимо, инициализируется;2: определяется имя (или имена) в данной локальной области имён (тоесть, в той, где находится данная инструкция «:keyword:`import`» ) .Инструкция бывает двух видов : с ключевым словом «:keyword:`from`» и без. Форма без «:keyword:`from`» повторяет указанные два шага для каждого идентификатора в списке. Форма с «:keyword:`from`» исполняет шаг 1 однократно, а затем исполняет шаг 2 многократно. Подробнее об реализации шага 1 смотрите в модуле «:mod:`importlib`» .

source: To understand how step (1) occurs, one must first understand how Python handles hierarchical naming of modules. To help organize modules and provide a hierarchy in naming, Python has a concept of packages. A package can contain other packages and modules while modules cannot contain other modules or packages. From a file system perspective, packages are directories and modules are files. The original `specification for packages <http://www.python.org/doc/essays/packages.html>`_ is still available to read, although minor details have changed since the writing of that document.
ru: Для понимания того, что происходит на первом шаге, нужно понимать, как Питон управляется с иерархическим именованием модулей. Для удобства организации модулей и возможности иерархического именования в Питоне есть своя концепция пакетов. Пакет может содержать другие пакеты и модули, тогда как модули не могут содержать ни других модулей ни пакетов. С точки зрения файловой системы – пакеты являются директориями (“каталогами”, “папками”) , а модули являются файлами. Оригинальная `спецификация пакетов<http://www.python.org/doc/essays/packages.html>`_ ещё доступна для чтения, хотя незначительные детали изменились со времени её написания.

source: Once the name of the module is known (unless otherwise specified, the term "module" will refer to both packages and modules), searching for the module or package can begin. The first place checked is :data:`sys.modules`, the cache of all modules that have been imported previously. If the module is found there then it is used in step (2) of import unless :keyword:`None` is found in :data:`sys.modules`, in which case :exc:`ImportError` is raised.
ru: Когда имя модуля становится известно (когда не указано иное – термин “модуль” будет подразумевать как модули, так и пакеты) – начинается поиск этого модуля или пакета. Сначала проверяется «:data:`sys.modules`» – это кэш всех модулей, которые уже́ были импортированы. Если искомый модуль там найден, то он и используется на шаге 2 импортирования. Но если в «:data:`sys.modules`» для этого имени найдено «:const:`None`» , то вызывается «:exc:`ImportError`» .

source: If the module is not found in the cache, then :data:`sys.meta_path` is searched (the specification for :data:`sys.meta_path` can be found in :pep:`302`). The object is a list of :term:`finder` objects which are queried in order as to whether they know how to load the module by calling their :meth:`find_module` method with the name of the module. If the module happens to be contained within a package (as denoted by the existence of a dot in the name), then a second argument to :meth:`find_module` is given as the value of the :attr:`__path__` attribute from the parent package (everything up to the last dot in the name of the module being imported). If a finder can find the module it returns a :term:`loader` (discussed later) or returns :keyword:`None`.
ru: Если модуль не найден в кэше, то производится поиск в «:data:`sys.meta_path`» (спецификацию «:data:`sys.meta_path`» можно посмотреть в “:pep:`302`” ) . Этот объект является списком объектов “:term:`finder`” , которые запрашиваются по порядку на предмет того, знают ли они как загружать данный модуль, посредством вызова их метода «:meth:`find_module`» с именем данного модуля. Если оказывается, что данный модуль содержится внутри пакета (как следует из наличия точки в имени) , то второй аргумент у «:meth:`find_module`» представляет собой значение атрибута «:attr:`__path__`» из родительского пакета (всё вплоть до последней точки в имени данного импортируемого модуля) . Если “:term:`finder`” может найти модуль, то он возвращает “загрузчик” (будет рассмотрено далее) , иначе возвращает «:const:`None`» .

source: If none of the finders on :data:`sys.meta_path` are able to find the module then some implicitly defined finders are queried. Implementations of Python vary in what implicit meta path finders are defined. The one they all do define, though, is one that handles :data:`sys.path_hooks`, :data:`sys.path_importer_cache`, and :data:`sys.path`.
ru: Если ни один из “:term:`finder`” в «:data:`sys.meta_path`» не оказался способен найти модуль, тогда запрашиваются какие-либо не явно определённые “:term:`finder`” . Реализации Питона различаются в том, каким неявным путём определяются “:term:`finder`” . Однако, одно, что все они определяют – то, что контролирует «:data:`sys.path_hooks`» , «:data:`sys.path_importer_cache`» , «:data:`sys.path`» .

source: Future statements
ru: Инструкция “future”

source: A :dfn:`future statement` is a directive to the compiler that a particular module should be compiled using syntax or semantics that will be available in a specified future release of Python. The future statement is intended to ease migration to future versions of Python that introduce incompatible changes to the language. It allows use of the new features on a per-module basis before the release in which the feature becomes standard.
ru: Инструкция “future” является особым случаем инструкции «:keyword:`import`» и является указанием компилятору о том, что данный модуль нужно компилировать, используя синтаксис либо семантику, которые будут доступны в указанной будущей версии Питона. Инструкция “future” нацелена на облегчение миграции на новые версии Питона, в которых будут введены несовместимые изменения. Это позволяет использовать новые возможности (для этого потребуется установить соответствующие модули) до версии языка, в которой они станут стандартными.

source: A future statement must appear near the top of the module. The only lines that can appear before a future statement are:
ru: Инструкция “future” должна располагаться перед кодом модуля. До неё могут быть только следующие строки :

source: the module docstring (if any),
ru: строка документации модуля (если есть) ,

source: comments,
ru: коментарии,

source: blank lines, and
ru: пустые строки,

source: other future statements.
ru: другие инструкции “future” .

source: The features recognized by Python 3.0 are ``absolute_import``, ``division``, ``generators``, ``unicode_literals``, ``print_function``, ``nested_scopes`` and ``with_statement``. They are all redundant because they are always enabled, and only kept for backwards compatibility.
ru: Питон 3.0 знает следующие свойства : «``absolute_import``» , «``division``» , «``generators``» , «``unicode_literals``» , «``print_function``» , «``nested_scopes``» , «``with_statement``» . Но все они уже́ устарели, поскольку уже́ встроены в язык и всегда доступны, и сохранены только для обратной совместимости.

source: A future statement is recognized and treated specially at compile time: Changes to the semantics of core constructs are often implemented by generating different code. It may even be the case that a new feature introduces new incompatible syntax (such as a new reserved word), in which case the compiler may need to parse the module differently. Such decisions cannot be pushed off until runtime.
ru: Инструкция “future” распознаётся и обрабатывается особым образом на этапе компиляции, поскольку изменения в семантике базовых конструкций зачастую реализуются путём генерации и подстановки совсем другого кода (соответствующего текущей версии языка) . Может даже быть так, что новое свойство вводит новый несовместимый синтаксис (например, новое зарезервированное слово) , в результате чего компилятору необходимо интерпретировать данный модуль совсем по-другому. Такие меры не могут быть отложены до этапа исполнения программы (“runtime”) .

source: For any given release, the compiler knows which feature names have been defined, and raises a compile-time error if a future statement contains a feature not known to it.
ru: Компилятор знает, какие имена будущих свойств определены в конкретной данной версии и инициирует ошибку этапа компилирования, если инструкция “future” содержит свойство, которое ему не известно.

source: The direct runtime semantics are the same as for any import statement: there is a standard module :mod:`__future__`, described later, and it will be imported in the usual way at the time the future statement is executed.
ru: За исключением указанного выше – на этапе исполнения имеет тот же смысл, что и любое выражение «:keyword:`import`» , тоесть : имеется стандартный модуль «:mod:`__future__`» (описано далее) , и он будет импортирован обычным образом в момент исполнения соответствующей инструкции “future” .

source: The interesting runtime semantics depend on the specific feature enabled by the future statement.
ru: Влияние на выполнение программы сильно зависит от того, какие свойства задействованы.

source: Note that there is nothing special about the statement::
ru: Заметьте, что следующая инструкция не интерпретируется как-либо исключительно : ::

source: That is not a future statement; it's an ordinary import statement with no special semantics or syntax restrictions.
ru: Это не инструкция “future” – это обычная инструкция «:keyword:`import`» без каких-либо исключительных смысла или синтаксиса.

source: Code compiled by calls to the built-in functions :func:`exec` and :func:`compile` that occur in a module :mod:`M` containing a future statement will, by default, use the new syntax or semantics associated with the future statement. This can be controlled by optional arguments to :func:`compile` --- see the documentation of that function for details.
ru: Код, компилируемый посредством встроенных функций «:func:`exec`» и «:func:`compile`» , вызываемых из модуля, содержащего инструкцию “future” , по-умолчанию тоже испытывает эффект этой инструкции – интерпретируется с соответствующими новыми синтаксисом и смыслом. Для «:func:`compile`» этот эффект можно контролировать через необязательный аргумент (подробности смотрите в документации по данной функции) .

source: A future statement typed at an interactive interpreter prompt will take effect for the rest of the interpreter session. If an interpreter is started with the :option:`-i` option, is passed a script name to execute, and the script includes a future statement, it will be in effect in the interactive session started after the script is executed.
ru: Инструкция “future” , введённая на запрос интерактивного интерпретатора, будет оказывать эффект до конца работы интерпретатора. Если интерпретатор был запущен с опцией «:option:`-i`» и именем скрипта, и этот скрипт содержит инструкцию “future” , то она будет в силе и после перехода к интерактивной сессии после завершения скрипта.

source: The original proposal for the __future__ mechanism.
ru: Исходное предложение по механизму «``__future__``» .

source: The :keyword:`global` statement
ru: Инструкция «:keyword:`global`»

source: The :keyword:`global` statement is a declaration which holds for the entire current code block. It means that the listed identifiers are to be interpreted as globals. It would be impossible to assign to a global variable without :keyword:`global`, although free variables may refer to globals without being declared global.
ru: Действие инструкции «:keyword:`global`» распространяется на весь текущий блок кода. Она указывает, что перечисленные в ней идентификаторы должны интерпретироваться как глобальные. Может оказаться невозможным получить доступ к некой глобальной переменной без инструкции «:keyword:`global`» , но переменные, не связанные в данной области имён, обращаются к глобальным переменным – не будучи объявленными как глобальные.

source: Names listed in a :keyword:`global` statement must not be used in the same code block textually preceding that :keyword:`global` statement.
ru: Идентификаторы, перечисленные в инструкции «:keyword:`global`» не должны использоваться в том же блоке кода выше по тексту, чем эта инструкция.

source: Names listed in a :keyword:`global` statement must not be defined as formal parameters or in a :keyword:`for` loop control target, :keyword:`class` definition, function definition, or :keyword:`import` statement.
ru: Идентификаторы, перечисленные в инструкции «:keyword:`global`» не должны объявляться как параметры в определении функции, или как “цель” в конструкции цикла «:keyword:`for`» , или в определениях класса или функции, или в инструкции «:keyword:`import`» .

source: The current implementation does not enforce the latter two restrictions, but programs should not abuse this freedom, as future implementations may enforce them or silently change the meaning of the program.
ru: Текущая реализация не навязывает эти два последних ограничения, но всё-же программам не следует злоупотреблять этой свободой, поскольку будущие реализации могут ввести эти ограничения или, не выдавая сообщения об ошибке, интерпретировать по-другому.
